{
  "question": "Большой ли у вас бюджет?",
  "yes_node": {
    "question": "Приоритетно ли для Вас качество фотокамеры?",
    "yes_node": {
      "question": "Предпочитаете ли вы большой дисплей для работы с мультимедиа?",
      "yes_node": {
        "question": "Важна ли для вас поддержка 5G?",
        "yes_node": {
          "decision": "Рассмотрите iPhone 15 Pro или Samsung Galaxy S23 Ultra, которые отличаются первоклассной камерой, большим дисплеем и поддержкой 5G."
        },
        "no_node": {
          "decision": "Рассмотрите iPhone 15 Pro или Google Pixel 7 Pro, которые отличаются первоклассной камерой и большим дисплеем."
        },
        "likely_yes_node": {
          "decision": "Рассмотрите OnePlus 11 или Samsung Galaxy S23, которые отличаются хорошим соотношением камеры, дисплея и поддержки 5G."
        },
        "likely_no_node": {
          "decision": "Рассмотрите iPhone 15 или Google Pixel 7 с хорошей камерой и дисплеем, 5G может быть не приоритетным для вас."
        }
      },
      "no_node": {
        "question": "Нужны ли вам возможности расширения памяти?",
        "yes_node": {
          "decision": "Рассмотрите модель Samsung Galaxy S22 FE с хорошей камерой, большим дисплеем и возможностью расширения памяти."
        },
        "no_node": {
          "decision": "Рассмотрите модель Google Pixel 7 с хорошей камерой и большим дисплеем."
        },
        "likely_yes_node": {
          "decision": "Рассмотрите Samsung Galaxy S23 или Google Pixel 7 с хорошей камерой и дисплеем, может пригодиться возможность расширения памяти."
        },
        "likely_no_node": {
          "decision": "Рассмотрите iPhone 15 или OnePlus 11 с хорошей камерой и дисплеем, отдавая предпочтение другим характеристикам, а не памяти."
        }
      }
    },
    "no_node": {
      "question": "Является ли длительное время автономной работы главным приоритетом для вас?",
      "yes_node": {
        "question": "Предпочитаете ли вы компактные и легкие телефоны?",
        "yes_node": {
          "decision": "Рассмотрим Samsung Galaxy A32, который отличается большим аккумулятором, эффективным управлением питанием и компактным дизайном."
        },
        "no_node": {
          "decision": "Рассмотрите модель Motorola G Power с большим аккумулятором и эффективным управлением питанием."
        },
        "likely_yes_node": {
          "decision": "Рассмотрите iPhone 15 Plus за баланс характеристик, хорошую камеру и компактный дизайн."
        },
        "likely_no_node": {
          "decision": "Рассмотрите Google Pixel 7a за баланс характеристик, хорошую камеру и приемлемое время автономной работы."
        }
      },
      "no_node": {
        "question": "Предпочитаете ли Вы конкретную марку или операционную систему?",
        "yes_node": {
          "decision": "Рассмотрите iPhone 15 или Google Pixel 7 для обеспечения баланса функций и хорошего времени автономной работы."
        },
        "no_node": {
          "decision": "Рассмотрите Samsung Galaxy S23 или OnePlus 11, которые отличаются сбалансированным набором функций и хорошим временем автономной работы."
        },
        "likely_yes_node": {
          "decision": "Рассмотрите iPhone 15 или Google Pixel 7 для обеспечения баланса функций и хорошего времени автономной работы."
        },
        "likely_no_node": {
          "decision": "Рассмотрите Samsung Galaxy S23 или OnePlus 11, которые отличаются сбалансированным набором функций и хорошим временем автономной работы."
        }
      }
    },
    "likely_yes_node": {
      "decision": "Ознакомьтесь с различными телефонами среднего и флагманского уровня, такими как iPhone 15, Samsung Galaxy S23, Google Pixel 7, OnePlus 11, и сравните их в соответствии с вашими предпочтениями и требованиями."
    },
    "likely_no_node": {
      "decision": "Прежде чем принять решение, пересмотрите свои предпочтения и требования, чтобы сузить круг возможных вариантов. Для начала рассмотрите такие популярные модели, как iPhone 15, Samsung Galaxy S23, Google Pixel 7 и OnePlus 11."
    }
  },
  "no_node": {
    "question": "Вы ищете конкретную марку или операционную систему?",
    "yes_node": {
      "question": "Вам нужно устройство на базе iOS?",
      "yes_node": {
        "question": "Интересует ли Вас экосистема Apple?",
        "yes_node": {
          "decision": "Рассмотрите последнюю модель iPhone, чтобы обеспечить беспрепятственную интеграцию в экосистему Apple, безопасность и частое обновление программного обеспечения."
        },
        "no_node": {
          "decision": "В соответствии с вашими предпочтениями и выбором бренда рассмотрите такой авторитетный Android-телефон, как Samsung Galaxy S23 или OnePlus 11."
        },
        "likely_yes_node": {
          "decision": "Рассмотрите последнюю модель iPhone, чтобы в полной мере использовать возможности экосистемы Apple, даже если они несколько отличаются от привычных."
        },
        "likely_no_node": {
          "decision": "В соответствии с вашими предпочтениями и выбором бренда рассмотрите такой авторитетный Android-телефон, как Samsung Galaxy S23 или OnePlus 11."
        }
      },
      "no_node": {
        "question": "Предпочитаете ли вы индивидуальный подход и гибкость в выборе телефона?",
        "yes_node": {
          "decision": "Рассмотрим флагманские Android-телефоны, такие как Samsung Galaxy S23 или OnePlus 11, известные своими возможностями настройки, гибкостью и регулярными обновлениями."
        },
        "no_node": {
          "decision": "В зависимости от ваших предпочтений и выбора бренда для широкого спектра возможностей рассмотрите такие авторитетные телефоны на базе Android, как Samsung Galaxy S23 или OnePlus 11."
        },
        "likely_yes_node": {
          "decision": "Рассмотрим флагманские Android-телефоны, такие как Samsung Galaxy S23 или OnePlus 11, известные своими возможностями настройки, гибкостью и регулярными обновлениями."
        },
        "likely_no_node": {
          "decision": "В зависимости от ваших предпочтений и выбора бренда для широкого спектра возможностей рассмотрите такие авторитетные телефоны на базе Android, как Samsung Galaxy S23 или OnePlus 11."
        }
      }
    },
    "likely_yes_node": {
      "question": "Важна ли для вас компактность и легкость конструкции?",
      "yes_node": {
        "decision": "Рассмотрите модель Google Pixel 7a за компактный и легкий дизайн, хорошую камеру и удовлетворительное время автономной работы."
      },
      "no_node": {
        "decision": "Рассмотрите OnePlus 11 за баланс характеристик и хорошую камеру."
      },
      "likely_yes_node": {
        "decision": "Рассмотрите модель Google Pixel 7a за компактный и легкий дизайн, хорошую камеру и удовлетворительное время автономной работы."
      },
      "likely_no_node": {
        "decision": "Рассмотрите OnePlus 9 за баланс характеристик и хорошую камеру."
      }
    },
    "likely_no_node": {
      "question": "Интересуют ли вас расширенные функции безопасности, такие как распознавание лиц или сканер отпечатков пальцев?",
      "yes_node": {
        "decision": "Рассмотрите Samsung Galaxy S23 или OnePlus 11 за продвинутые функции безопасности, баланс возможностей и хорошую камеру."
      },
      "no_node": {
        "decision": "Рассмотрите модель Google Pixel 7, которая отличается сбалансированным набором функций и хорошей камерой."
      },
      "likely_yes_node": {
        "decision": "Рассмотрите Samsung Galaxy S23 или OnePlus 11 за продвинутые функции безопасности, баланс возможностей и хорошую камеру."
      },
      "likely_no_node": {
        "decision": "Рассмотрите модель Google Pixel 7, которая отличается сбалансированным набором функций и хорошей камерой."
      }
    }
  },
  "likely_yes_node": {
    "decision": "Ознакомьтесь с различными моделями телефонов среднего и флагманского класса, чтобы оценить, насколько они соответствуют вашим предпочтениям и требованиям."
  },
  "likely_no_node": {
    "decision": "Пересмотрите свои предпочтения и требования, чтобы сузить круг вариантов перед принятием решения. Для начала рассмотрите такие популярные модели, как iPhone 13, Samsung Galaxy S21, Google Pixel 6 и OnePlus 9."
  }
}
